In [2]:
# 분류 예습

In [1]:
from sklearn.linear_model import LogisticRegression

In [3]:
from sklearn.ensemble import RandomForestClassifier

In [4]:
from sklearn.svm import SVC

In [5]:
from sklearn.neighbors import KNeighborsClassifier

In [6]:
from sklearn.tree import DecisionTreeClassifier

In [7]:
from sklearn.naive_bayes import GaussianNB

In [8]:
from sklearn.model_selection import train_test_split

In [9]:
from sklearn.metrics import accuracy_score

In [10]:
import numpy as np

In [11]:
import matplotlib.pyplot as plt

In [12]:
import pandas as pd

In [13]:
pd.read_csv('./titanic.csv')

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [14]:
titanic_df=pd.read_csv('./titanic.csv')

In [15]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [44]:
import seaborn as sns

In [17]:
sns.load_dataset('titanic')

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [45]:
titanic_df=sns.load_dataset('titanic')

In [19]:
titanic_df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [22]:
titanic_df['deck']

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [23]:
titanic_df['deck'].value_counts()

deck
C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: count, dtype: int64

In [24]:
titanic_df['deck'].value_counts(dropna=False)

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [25]:
nan_deck=titanic_df['deck'].value_counts(dropna=False)

In [27]:
nan_deck

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [ ]:
# 결측값 관련 인식(0,False,'',None, null,NA, NaN ) 정리하세요

In [28]:
nan_deck.sum()

np.int64(891)

In [32]:
titanic_df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [46]:
titanic_df.dropna(axis=1,thresh=500, inplace=True)

In [35]:
titanic_df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [37]:
# 결측치 삭제 후에는 정확하게 행과 열의 갯수가 맞는지 반드시 확인

In [47]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  889 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 79.4+ KB

In [39]:
891-714

177

In [ ]:
# titanic_df.dropna(subset=['age'], axis=0, inplace=True)

In [48]:
titanic_df['age'].isna().sum()

np.int64(177)

In [42]:
titanic_df['age'].mean()

np.float64(29.69911764705882)

In [43]:
mean_age=titanic_df['age'].mean()

In [49]:
titanic_df['age'].fillna(mean_age, inplace=True)

C:\Users\mbc\AppData\Local\Temp\ipykernel_8544\3419352568.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_df['age'].fillna(mean_age, inplace=True)

In [50]:
titanic_df['age'].isna().sum()

np.int64(0)

In [51]:
titanic_df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [52]:
titanic_df['embark_town']

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [53]:
titanic_df['embark_town'].isna().sum()

np.int64(2)

In [54]:
titanic_df['embark_town'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [55]:
titanic_df['embark_town'].value_counts()

embark_town
Southampton    644
Cherbourg      168
Queenstown      77
Name: count, dtype: int64

In [57]:
titanic_df.mode()

   survived  pclass   sex        age  ...  adult_male  embark_town  alive alone
0         0       3  male  29.699118  ...        True  Southampton     no  True

[1 rows x 14 columns]

In [58]:
titanic_df['embark_town'].mode()

0    Southampton
Name: embark_town, dtype: object

In [59]:
titanic_df['embark_town'].mode()[0]

'Southampton'

In [61]:
most_freq=titanic_df['embark_town'].mode()[0]

In [60]:
titanic_df['embark_town'].value_counts().idxmax()

'Southampton'

In [62]:
titanic_df['embark_town'].fillna(most_freq, inplace=True)

In [63]:
titanic_df['embark_town'].isna().sum()

np.int64(0)

In [64]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  891 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 79.4+ KB

In [65]:
np.sqrt(5**2+12**2)

np.float64(13.0)

In [66]:
np.sqrt(9**2+12**2)

np.float64(15.0)